---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSet.IsAutomatic
source: html/9e9f7c81-2bcd-15f3-295c-b2acaa55e2a2.htm
---
# Autodesk.Revit.DB.ViewSheetSet.IsAutomatic Property

Automatic order or manual order.

## Syntax (C#)
```csharp
public virtual bool IsAutomatic { get; set; }
```